# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра

def add_bun():
    print('А теперь добавим булочку')

def add_cotlet():
    print('А теперь добавим котлету')

def add_cucumber():
    print('А теперь добавим огурчик')

def add_tomato():
    print('А теперь добавим помидорчик')

def add_mayones():
    print('А теперь добавим майонез')

def add_cheese():
    print('А теперь добавим сыр')
